{"config": [{"config": {"kernel_size": [5, 5], "batch_input_shape": [null, 1, 64, 64], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "dtype": "float32", "filters": 64, "use_bias": true, "trainable": true, "padding": "valid", "name": "conv2d_19", "bias_constraint": null, "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_10", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 5], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "filters": 32, "use_bias": true, "trainable": true, "padding": "valid", "name": "conv2d_20", "activation": "relu", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"seed": null, "trainable": true, "rate": 0.2, "name": "dropout_28", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_11"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 784, "activity_regularizer": null, "name": "dense_36", "trainable": true, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "rate": 0.2, "name": "dropout_29", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 256, "activity_regularizer": null, "name": "dense_37", "trainable": true, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "rate": 0.2, "name": "dropout_30", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 64, "activity_regularizer": null, "name": "dense_38", "trainable": true, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 6, "activity_regularizer": null, "name": "dense_39", "trainable": true, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.2"}