{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "batch_input_shape": [null, 1, 64, 64], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "conv2d_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "data_format": "channels_first", "kernel_size": [5, 5]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [5, 5]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 784, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 196, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 64, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "use_bias": true, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "units": 6, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "softmax", "use_bias": true, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}], "keras_version": "2.1.2", "backend": "tensorflow"}